"""
Напишите программу, в которой пользователь должен ввести текущий год и год своего рождения.
Программа вычисляет возраст пользователя и выводит соответствующее сообщение.
"""

year=int(input('Введите текущий год : '))
year_berth=int(input('Введите год своего рождения: '))

print('Возраст пользователя ', year-year_berth)