# Напишите программу, которая запрашивается у пользователя
# день и месяц, после выводится на экран.

day=input('Укажите день: ')
month=input('Укажите месяц: ')

print(day+" " + month)