"""
Напишите программу, в к-й расстояние, указанное в милях, переводится в километры.
Учесть, что одна миля ровна 1,6 км. Расстояние в милях вводится пользователем с клавиатуры.
"""

miles=int(input('Введите расстояние в милях: '))
print('Введенное расстояние в милях соответствует ', 1.6*miles, 'километрам')