"""
Задача №9. Решение в группах
По данному целому неотрицательному n вычислите
значение n!. N! = 1 * 2 * 3 * … * N (произведение всех
чисел от 1 до N) 0! = 1 Решить задачу используя цикл
while
Input: 5
Output: 120
"""

# def get_factorial(number):
#     if number >= 1:
#         k=1
#         f = 1
#         while k<=number:
#             f*=k
#             k+=1
#         print(f'Факториал числа {number} равен {f}')
#     elif number == 0:
#         print(f'Факториал числа {number} равен 1')
#     else:
#         print('Введите положительное число!')
#
#
# def main():
#     number=int(input('Введите число для расчета факториала: '))
#     get_factorial(number)
# main()



