"""
Напишите программу, в которой вычисляется факториал числа.
Факториалом числа n! числа n называется произведение всех чисел от единицы до n
n!=1*2*3...*n. Число для которого вычисляется факториал, вводится пользователем с клавиатуры.
В программе должна выполнятся проверка того, что пользователь ввел положительное число.
(используйте условный оператор)
"""

# def get_factorial_for_number(number):
#     if number >= 1:
#         f = 1
#         for k in range(2, number + 1):
#             f *= k
#         print(f'Факториал числа {number} равен {f}')
#     elif number == 0:
#         print(f'Факториал числа {number} равен 1')
#     else:
#         print('Введите положительное число!')
#
#
# def main():
#     number = int(input('Введи число для вычисления факториала: '))
#     get_factorial_for_number(number)
#
#
# main()
