"""
Напишите программу, в которой пользователь вводит целое число, а программа определяет,
сколько в это числе цифр 0,1,2 и т.д, до 9
"""
#
# import math
#
#
# def show_number_in_number():
#     try:
#         n = input('Введите любое число: ')
#         if type(eval(n)) == int:
#             for i in n:
#                 if i==0:
#
#                 # print(f'В веденном числе {n} содержится цифр {count} ', end=' ')
#     except n < 0:
#         n = abs(eval(n) * (-1))
#         print(f'В веденном числе {n} содержится цифр {len(n)} ', end=' ')
#     except:
#         print('Что-то пошло не так!')
#
#
# def main():
#     show_number_in_number()
#
#
# if __name__ == '__main__':
#     main()


# superset = set('123456')
# print(superset)
#
# element = superset.pop()
# print(element, len(superset))
# print(superset)

