"""
Создать проект калькулятора комплексных чисел (достаточно сделать сложение, умножение и деление).
Применить при создании программы архитектурные паттерны, добавить логирование калькулятора.
Соблюдать принципы SOLID, паттерны проектирования.
Можно выбрать другой язык программирования, например C# или Python, если выбран язык, отличный от JAVA,
то необходимо написать документ, каким образом можно запустить приложение (что необходимо установить,
каким образом запускать и т.п.).
"""
from OOP.homework_lesson_7.Controller import Controller


def main():
    controller = Controller()
    controller.switch_case(*controller.view.input_from_user())


if __name__ == '__main__':
    main()
